Documents/ДвижениеОбучающихся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ДвижениеОбучающихся</Name>
			<BasedOn>
				<xr:Item>Catalog.Обучающиеся</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДвиженияОбучающихся</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебныйГод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Классы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвиженияОбучающегося</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Литера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Обучающиеся</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отличник</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Класс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Классы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыДвиженияОбучающегося.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыДвиженияОбучающегося</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НовыйУчебныйГод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереходМеждуКлассами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаОбучение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеОбучения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ДвижениеОбучающихся/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДвижениеОбучающихся.Номер КАК НомерПриказа,
	|	ДвижениеОбучающихся.Дата КАК ДатаПриказа,
	|	ДвижениеОбучающихся.Обучающиеся.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ФИО КАК ФИО,
	|		Класс КАК Класс
	|	) КАК Обучающиеся,
	|	ДвижениеОбучающихся.ДатаДействия КАК ДатаДействия,
	|	ДвижениеОбучающихся.УчебныйГод КАК УчебныйГод,
	|	ДвижениеОбучающихся.ТипДокумента КАК ТипДокумента,
	|	ДвижениеОбучающихся.Комментарий КАК Комментарий,
	|	ДвижениеОбучающихся.Ссылка КАК ДокументСсылка,
	|	ДвижениеОбучающихся.Литера КАК Литера
	|ИЗ
	|	Документ.ДвижениеОбучающихся КАК ДвижениеОбучающихся
	|ГДЕ
	|	ДвижениеОбучающихся.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗапросКонстанта = Новый Запрос("Выбрать Константы.РуководительОрганизации Как Объект Из Константы");
	Руководитель = ЗапросКонстанта.Выполнить().Выбрать();
	Если Не Руководитель.Следующий() Тогда
		Сообщить("Ошибка: Не удалось получить данные о руководителе организации");
		Возврат;
    КонецЕсли;
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Если Выборка.ТипДокумента = Перечисления.ТипыДвиженияОбучающегося.ПустаяСсылка() Тогда
			Сообщить("Пустой документ");
			Возврат;
		ИначеЕсли Выборка.ТипДокумента = Перечисления.ТипыДвиженияОбучающегося.ПриемНаОбучение Тогда
			ВыводПриказОЗачислении(Выборка,ТабДок,Руководитель.Объект);	
		ИначеЕсли Выборка.ТипДокумента = Перечисления.ТипыДвиженияОбучающегося.ПереходМеждуКлассами Тогда
			ВыводПриказОПереводе(Выборка,ТабДок,Руководитель.Объект);
		ИначеЕсли Выборка.ТипДокумента = Перечисления.ТипыДвиженияОбучающегося.Отчисление Тогда
			ВыводПриказОбОтчислении(Выборка,ТабДок,Руководитель.Объект);
		ИначеЕсли Выборка.ТипДокумента = Перечисления.ТипыДвиженияОбучающегося.ОкончаниеОбучения Тогда
			ВыводПриказОбОкончанииОбучения(Выборка,ТабДок,Руководитель.Объект);
		ИначеЕсли Выборка.ТипДокумента = Перечисления.ТипыДвиженияОбучающегося.НовыйУчебныйГод Тогда	
			ВыводПриказНовыйУчебныйГод(Выборка,ТабДок,Руководитель.Объект);	
		Иначе
			Сообщить("Макет не реализован");
			Возврат	
		КонецЕсли;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
